tangyangguang/Esp32_Faucet/src/web/FaucetWeb.cpp
bool deleteLatestTraceFromDevice(const WaterRecord& record) {
    if (!ensureSavedPulseTracesReady()) {
        return false;
    }
    WaterPulseTrace savedTrace{};
    return g_context.savedPulseTraces->findByRecord(record, savedTrace) &&
           g_context.savedPulseTraces->remove(savedTrace.traceId);
}

void storeSegmentedCandidate(SystemConfig& config, const SegmentedCalibrationResult& result) {
    config.meteringCandidate.ready = result.valid;
    config.meteringCandidate.params =
        MeteringParameters{result.startupPulseCount, result.startupVolumeMl, result.stablePulsePerLiter};
    config.meteringCandidate.generatedAt = g_context.nowSeconds ? g_context.nowSeconds() : 0;
    std::snprintf(config.meteringCandidate.note,
                  sizeof(config.meteringCandidate.note),
                  "样本数量 %u，容量范围 %luml-%luml，最大误差 %luml，启动阶段典型 %lus。",
                  static_cast<unsigned>(result.sampleCount),
                  static_cast<unsigned long>(result.minActualMl),
                  static_cast<unsigned long>(result.maxActualMl),
                  static_cast<unsigned long>(result.maxErrorMl),
                  static_cast<unsigned long>(result.startupDurationSec));
}

bool generateSegmentedCalibrationCandidateFromSavedSamples() {
    if (!g_context.config) {
        return false;
    }
    const SegmentedSampleDiagnostics diagnostics = collectSegmentedSampleDiagnostics(false);
    if (!diagnostics.result.valid) {
        return false;
    }
    SystemConfig next = *g_context.config;
    storeSegmentedCandidate(next, diagnostics.result);
    return persistConfig(next);
}

bool saveCandidateToActiveMeteringSlot() {
    if (!g_context.config || !g_context.config->meteringCandidate.ready) {
        return false;
    }
    SystemConfig next = *g_context.config;
    if (!saveCandidateToMeteringSlot(next, next.activeMeteringSlot, g_context.nowSeconds ? g_context.nowSeconds() : 0)) {
        return false;
    }
    return persistConfig(next);
}

bool saveCandidateToRequestedMeteringSlot(std::uint8_t slotIndex) {
    if (!g_context.config || !g_context.config->meteringCandidate.ready || slotIndex >= kMeteringSlotCount) {
        return false;
    }
    SystemConfig next = *g_context.config;
    if (!saveCandidateToMeteringSlot(next, slotIndex, g_context.nowSeconds ? g_context.nowSeconds() : 0)) {
        return false;
    }
    return persistConfig(next);
}

void sendSignedLiters(std::int32_t ml) {
    if (ml < 0) {
        Esp32BaseWeb::sendChunk("-");
        sendLiters(static_cast<std::uint32_t>(-ml));
        return;
    }
    Esp32BaseWeb::sendChunk("+");
    sendLiters(static_cast<std::uint32_t>(ml));
}

bool shouldShowTargetDelta(const WaterRecord& record) {
    if (record.mode != WaterMode::Volume || record.targetValue == 0) {
        return false;
    }
    const std::int32_t diff =
        static_cast<std::int32_t>(record.volumeMl) - static_cast<std::int32_t>(record.targetValue);
    const std::uint32_t absDiff = diff < 0 ? static_cast<std::uint32_t>(-diff) : static_cast<std::uint32_t>(diff);
    return absDiff >= 100UL && absDiff * 100UL >= record.targetValue * 3UL;
}

void sendTargetDeltaHint(const WaterRecord& record) {
    if (!shouldShowTargetDelta(record)) {
        return;
    }
    const std::int32_t diff =
        static_cast<std::int32_t>(record.volumeMl) - static_cast<std::int32_t>(record.targetValue);
    Esp32BaseWeb::sendChunk("<small class='hint'>较目标 ");
    sendSignedLiters(diff);
    Esp32BaseWeb::sendChunk("</small>");
}

const char* traceStateText(WaterPulseTraceState state) {
    switch (state) {
        case WaterPulseTraceState::Running:
            return "运行";
        case WaterPulseTraceState::Paused:
            return "暂停";
        case WaterPulseTraceState::Completed:
            return "完成";
        case WaterPulseTraceState::Stopped:
            return "停止";
        case WaterPulseTraceState::PauseTimeout:
            return "暂停超时";
        case WaterPulseTraceState::SafetyStopped:
            return "安全停止";
        case WaterPulseTraceState::Error:
        default:
            return "异常";
    }
}

void sendPlainTextResponse(int status, const char* body) {
    Esp32BaseWeb::sendResponseHeader("Cache-Control", "no-store");
    Esp32BaseWeb::sendResponseHeader("X-Content-Type-Options", "nosniff");
    if (!Esp32BaseWeb::beginResponse(status, "text/plain; charset=utf-8", nullptr)) {
        return;
    }
    Esp32BaseWeb::sendChunk(body ? body : "");
    Esp32BaseWeb::endResponse();
}

std::size_t rawTracePreviewSampleCount(const WaterPulseTrace& trace) {
    const std::size_t previewLimit = kRawTracePreviewLastSecond + 1U;
    return std::min(trace.sampleCount, previewLimit);
}

void sendPulseTraceRawText(const WaterPulseTrace& trace,
                           const WaterPulseTraceSample* samples,
                           bool rawTraceShowAll) {
    Esp32BaseWeb::sendResponseHeader("Cache-Control", "no-store");
    Esp32BaseWeb::sendResponseHeader("X-Content-Type-Options", "nosniff");
    if (!Esp32BaseWeb::beginResponse(200, "text/plain; charset=utf-8", nullptr)) {
        return;
    }
    Esp32BaseWeb::sendChunk("时间\t脉冲数\t累计脉冲数\t状态\n");
    std::uint32_t cumulative = 0;
    const std::size_t sampleCount = rawTraceShowAll ? trace.sampleCount : rawTracePreviewSampleCount(trace);
    for (std::size_t i = 0; i < sampleCount; ++i) {
        cumulative += samples[i].pulseDelta;
        sendFmt("%lu秒\t%u\t%lu\t%s\n",
                static_cast<unsigned long>(i),
                static_cast<unsigned>(samples[i].pulseDelta),
                static_cast<unsigned long>(cumulative),
                traceStateText(samples[i].state));
    }
    if (!rawTraceShowAll && trace.sampleCount > sampleCount) {
        sendFmt("仅显示 0秒 到 %lu秒，共 %lu 行；完整明细请使用 all=1。\n",
                static_cast<unsigned long>(kRawTracePreviewLastSecond),
                static_cast<unsigned long>(sampleCount));
    }
    Esp32BaseWeb::endResponse();
}

std::uint32_t bucketRunningPulseDelta(const WaterPulseTraceSample* samples,
                                      std::size_t sampleCount,
                                      const WaterPulseTraceBucket& bucket) {
    if (!samples || sampleCount == 0) {
        return bucket.state == WaterPulseTraceState::Running ? bucket.pulseDelta : 0;
    }
    const std::size_t begin = std::min<std::size_t>(sampleCount, bucket.startSec);
    const std::size_t end = std::min<std::size_t>(sampleCount, begin + bucket.durationSec);
    std::uint32_t total = 0;
    for (std::size_t i = begin; i < end; ++i) {
        if (samples[i].state == WaterPulseTraceState::Running) {
            total += samples[i].pulseDelta;
        }
    }
    return total;
}

bool bucketOnlyHasRunningSamples(const WaterPulseTraceSample* samples,
                                 std::size_t sampleCount,
                                 const WaterPulseTraceBucket& bucket) {
    if (!samples || sampleCount == 0) {
        return bucket.state == WaterPulseTraceState::Running;
    }
    const std::size_t begin = std::min<std::size_t>(sampleCount, bucket.startSec);
    const std::size_t end = std::min<std::size_t>(sampleCount, begin + bucket.durationSec);
    if (begin >= end) {
        return false;
    }
    for (std::size_t i = begin; i < end; ++i) {
        if (samples[i].state != WaterPulseTraceState::Running) {
            return false;
        }
    }
    return true;
}

void formatKb(std::size_t bytes, char* out, std::size_t len) {
    const std::uint32_t tenths = static_cast<std::uint32_t>((bytes * 10U + 512U) / 1024U);
    std::snprintf(out, len, "%lu.%luKB", static_cast<unsigned long>(tenths / 10U),
                  static_cast<unsigned long>(tenths % 10U));
}

void sendSegmentedMeteringPanel() {
    const SystemConfig& config = *g_context.config;
    const SegmentedSampleDiagnostics diagnostics = collectSegmentedSampleDiagnostics(false);
    const bool candidateReady = config.meteringCandidate.ready;
    const bool canGenerate = diagnostics.result.valid;
    const MeteringParameters& active = activeMeteringParameters(config);
    char stable[24]{};
    char startupPulse[24]{};
    char startupVolume[24]{};
    char sampleCountText[32]{};
    char sampleRange[48]{};
    char sampleNeed[48]{};
    char error[24]{};
    std::snprintf(stable, sizeof(stable), "%luP/L", static_cast<unsigned long>(active.stablePulsePerLiter));
    std::snprintf(startupPulse, sizeof(startupPulse), "%luP", static_cast<unsigned long>(active.startupPulseCount));
    formatLiters(active.startupVolumeMl, startupVolume, sizeof(startupVolume));
    if (candidateReady) {
        std::snprintf(sampleCountText, sizeof(sampleCountText), "已生成");
        std::snprintf(sampleRange, sizeof(sampleRange), "见创建说明");
        std::snprintf(sampleNeed, sizeof(sampleNeed), "0条");
    } else {
        std::snprintf(sampleCountText,
                      sizeof(sampleCountText),
                      "%u/%u 条",
                      static_cast<unsigned>(diagnostics.validSampleCount),
                      static_cast<unsigned>(kSegmentedCalibrationRequiredSamples));
        std::snprintf(sampleRange, sizeof(sampleRange), "-");
        if (diagnostics.validSampleCount < kSegmentedCalibrationRequiredSamples) {
            std::snprintf(sampleNeed,
                          sizeof(sampleNeed),
                          "%u条可生成样本",
                          static_cast<unsigned>(kSegmentedCalibrationRequiredSamples - diagnostics.validSampleCount));
        } else {
            std::snprintf(sampleNeed, sizeof(sampleNeed), "容量差异>0.50 L的样本");
        }
    }
    std::snprintf(error, sizeof(error), candidateReady ? "见说明" : "-");
    Esp32BaseWeb::sendChunk("<section class='panel records-diagnostic-panel metering-status-diagnostic'><div class='diagnostic-head'><h3>计量状态</h3>");
    sendFmt("<span class='status-pill %s'>%s</span></div><div class='diagnostic-metric-grid three'>",
            candidateReady ? "status-ok" : canGenerate ? "status-warn" : "status-muted",
            candidateReady ? "候选已生成，不自动启用" : canGenerate ? "可生成" : "样本不足");
    sendFmt("<div class='diagnostic-metric'><span>当前启用参数槽</span><strong>%u</strong></div>",
            static_cast<unsigned>(config.activeMeteringSlot + 1));
    sendFmt("<div class='diagnostic-metric'><span>稳态P/L</span><strong>%s</strong></div>", stable);
    sendFmt("<div class='diagnostic-metric'><span>启动脉冲数</span><strong>%s</strong></div>", startupPulse);
    sendFmt("<div class='diagnostic-metric'><span>启动水量</span><strong>%s</strong></div>", startupVolume);
    Esp32BaseWeb::sendChunk("</div><div class='diagnostic-foot'>");
    sendFmt("<span>当前名称 <b>");
    sendHtmlEscapedBounded(config.meteringSlots[config.activeMeteringSlot].name, sizeof(config.meteringSlots[config.activeMeteringSlot].name));
    Esp32BaseWeb::sendChunk("</b></span>");
    Esp32BaseWeb::sendChunk("</div></section>");

    Esp32BaseWeb::sendChunk("<section class='panel records-diagnostic-panel sample-coverage-diagnostic'><div class='diagnostic-head'><h3>样本覆盖</h3>");
    sendFmt("<span class='status-pill %s'>%s</span></div><div class='diagnostic-metric-grid'>",
            canGenerate ? "status-ok" : "status-muted",
            canGenerate ? "可生成" : "样本不足");
    sendFmt("<div class='diagnostic-metric'><span>可生成样本</span><strong>%s</strong></div>", sampleCountText);
    sendFmt("<div class='diagnostic-metric'><span>容量范围</span><strong>%s</strong></div>", sampleRange);
    sendFmt("<div class='diagnostic-metric'><span>拟合误差</span><strong>%s</strong></div>", error);
    sendFmt("<div class='diagnostic-metric'><span>还需</span><strong>%s</strong></div>", candidateReady ? "0条" : sampleNeed);
    Esp32BaseWeb::sendChunk("</div><div class='diagnostic-foot'>");
    sendFmt("<span>已保存明细 <b>%u条</b></span><span>已测容量 <b>%u条</b></span>",
            static_cast<unsigned>(diagnostics.savedTraceCount),
            static_cast<unsigned>(diagnostics.measuredSampleCount));
    sendFmt("<span>还需 <b>%s</b></span>", candidateReady ? "0条" : sampleNeed);
    Esp32BaseWeb::sendChunk("</div></section>");
}

void sendPulseTraceCachePanel() {
    WaterPulseTraceStats stats{};
    if (!g_context.pulseTraces) {
        Esp32BaseWeb::sendChunk("<section class='panel records-diagnostic-panel trace-cache-diagnostic'><div class='diagnostic-head'><h3>RAM 最近明细</h3>"
                                "<span class='status-pill status-error'>RAM 不可用</span></div>"
                                "<div class='diagnostic-metric-grid'><div class='diagnostic-metric'><span>最近明细</span><strong>-</strong></div>"
                                "<div class='diagnostic-metric'><span>RAM 数据点</span><strong>-</strong></div></div>"
                                "<div class='diagnostic-foot'><span>RAM 占用 <b>-</b></span><span>单条上限 <b>-</b></span></div></section>");
    } else {
        stats = g_context.pulseTraces->stats();
        char used[24]{};
        formatKb(stats.usedBytes, used, sizeof(used));
        char traces[24]{};
        char samples[32]{};
        std::snprintf(traces,
                      sizeof(traces),
                      "%lu / %lu 条",
                      static_cast<unsigned long>(stats.traceCount),
                      static_cast<unsigned long>(g_context.config ? g_context.config->recentPulseTraceCount : stats.traceCapacity));
        std::snprintf(samples,
                      sizeof(samples),
                      "%lu / %lu 点",
                      static_cast<unsigned long>(stats.sampleCount),
                      static_cast<unsigned long>(stats.sampleCapacity));
        Esp32BaseWeb::sendChunk("<section class='panel records-diagnostic-panel trace-cache-diagnostic'><div class='diagnostic-head'><h3>RAM 最近明细</h3>"
                                "<span class='status-pill status-muted ram-badge'>RAM</span></div><div class='diagnostic-metric-grid'>");
        sendFmt("<div class='diagnostic-metric'><span>最近明细</span><strong>%s</strong></div>", traces);
        sendFmt("<div class='diagnostic-metric'><span>RAM 数据点</span><strong>%s</strong></div>", samples);
        sendFmt("</div><div class='diagnostic-foot'><span>RAM 占用 <b>%s</b></span><span>单条上限 <b>%lu 点</b></span></div></section>",
                used,
                static_cast<unsigned long>(stats.sampleCapacityPerTrace));
    }

