tangyangguang/Esp32_Faucet/src/web/FaucetWeb.cpp
struct CalibrationSampleState {
    std::uint32_t actualMl = 0;
    std::uint32_t stableStartSec = 0;
    bool stable = false;
    bool qualityValid = false;
    bool truncated = false;
};

CalibrationSampleState inspectCalibrationSample(const WaterPulseTrace& trace, bool savedSource) {
    CalibrationSampleState state{};
    state.actualMl = actualMlForSegmentedSample(trace);
    state.truncated = trace.truncated;
    if (trace.truncated) {
        return state;
    }
    if (trace.sampleCount < 6 || trace.totalPulses == 0) {
        return state;
    }
    WaterPulseTraceSample* samples = new (std::nothrow) WaterPulseTraceSample[trace.sampleCount]{};
    if (!samples) {
        return state;
    }
    const bool copied = savedSource ? copySavedTraceSamples(trace, samples, trace.sampleCount)
                                    : copyRamTraceSamples(trace, samples, trace.sampleCount);
    if (copied) {
        const WaterPulseTraceAnalysis analysis = analyzeWaterPulseTrace(trace, samples, trace.sampleCount);
        state.stable = analysis.stable && analysis.stablePulseCount > 0;
        state.stableStartSec = analysis.stableStartSec;
        state.qualityValid = state.actualMl > 0 && state.stable;
    }
    delete[] samples;
    return state;
}

void sendCalibrationSampleStatusPills(const CalibrationSampleState& state, bool savedSource, const char* containerClass) {
    sendFmt("<span class='%s'>", containerClass);
    if (state.truncated) {
        Esp32BaseWeb::sendChunk("<span class='status-pill status-warn'>明细已截断</span>"
                                "<span class='status-pill status-muted'>不入库</span>");
        Esp32BaseWeb::sendChunk("</span>");
        return;
    }
    if (state.actualMl == 0) {
        Esp32BaseWeb::sendChunk("<span class='status-pill status-muted'>待确认容量</span>");
        Esp32BaseWeb::sendChunk("</span>");
        return;
    }
    Esp32BaseWeb::sendChunk("<span class='status-pill status-ok'>容量已确认</span>");
    if (!state.stable) {
        Esp32BaseWeb::sendChunk("<span class='status-pill status-warn'>稳态失败</span>");
        Esp32BaseWeb::sendChunk("</span>");
        return;
    }
    Esp32BaseWeb::sendChunk(savedSource ? "<span class='status-pill status-ok'>可参与生成</span>"
                                        : "<span class='status-pill status-warn'>可入库</span>");
    Esp32BaseWeb::sendChunk("</span>");
}

bool traceAlreadyListed(const WaterRecord* records, std::size_t count, const WaterRecord& record) {
    for (std::size_t i = 0; i < count; ++i) {
        if (sameWaterRecordIdentity(records[i], record)) {
            return true;
        }
    }
    return false;
}

bool latestRamTraceCanEnterSampleStore(const WaterRecord& record) {
    const WaterPulseTrace* ramTrace = g_context.pulseTraces ? g_context.pulseTraces->findByRecord(record) : nullptr;
    if (!ramTrace) {
        return false;
    }
    WaterPulseTrace savedTrace{};
    if (ensureSavedPulseTracesReady() && g_context.savedPulseTraces->findByRecord(record, savedTrace)) {
        return false;
    }
    return inspectCalibrationSample(*ramTrace, false).qualityValid;
}

bool calibrationContextRequested() {
    char text[24]{};
    return (getParam("from", text, sizeof(text)) && std::strcmp(text, "calibration") == 0) ||
           (getParam("returnTo", text, sizeof(text)) && std::strcmp(text, "calibration") == 0);
}

std::uint32_t selectedSamplePulseWindowSec() {
    char text[16]{};
    std::uint32_t seconds = kDefaultSamplePulseWindowSec;
    if (getParam("sampleSeconds", text, sizeof(text)) && parseU32(text, seconds)) {
        return std::min<std::uint32_t>(std::max<std::uint32_t>(seconds, kMinSamplePulseWindowSec),
                                       kMaxSamplePulseWindowSec);
    }
    return kDefaultSamplePulseWindowSec;
}

void sendTraceDetailLink(bool fromCalibration,
                         bool savedSource,
                         std::uint32_t traceId,
                         std::uint32_t bucket,
                         const char* label,
                         const char* className = "btn-link") {
    const char* detailPath = fromCalibration ? "/faucet/calibration/detail" : "/faucet/records/detail";
    sendFmt("<a class='%s' href='%s?%s%strace=%lu&bucket=%lu'>%s</a>",
            className,
            detailPath,
            fromCalibration ? "from=calibration&" : "",
            savedSource ? "saved=1&" : "",
            static_cast<unsigned long>(traceId),
            static_cast<unsigned long>(bucket),
            label);
}

void sendLatestCalibrationRecordPanel(bool canCalibrate, const WaterRecord& record) {
    Esp32BaseWeb::sendChunk("<section id='latest-record' class='panel latest-record-panel'><div class='panel-head'><h3>最后一条出水记录</h3></div>");
    if (!canCalibrate) {
        Esp32BaseWeb::sendChunk("<p class='err'>最新记录不可确认容量：没有可用原始脉冲或结束状态不适合校准。</p></section>");
        return;
    }

    char startTime[40]{};
    char targetText[32]{};
    formatWaterRecordListTime(record, startTime, sizeof(startTime));
    formatRecordTargetValue(record, targetText, sizeof(targetText));
    WaterRecordCalibration calibration{};
    const bool calibrated = findRecordCalibration(record, calibration);
    const std::uint32_t defaultActualMl = calibrated ? calibration.actualMl : record.volumeMl;
    const std::uint32_t pulsePerLiter = historicalPulsePerLiter(record.pulsePerMlAtRun);
    const WaterPulseTrace* ramTrace = g_context.pulseTraces ? g_context.pulseTraces->findByRecord(record) : nullptr;
    WaterPulseTrace savedTrace{};
    const bool hasSavedTrace =
        ensureSavedPulseTracesReady() && g_context.savedPulseTraces->findByRecord(record, savedTrace);
    const WaterPulseTrace* sampleTrace = hasSavedTrace ? &savedTrace : ramTrace;
    const bool sampleSavedSource = hasSavedTrace;
    CalibrationSampleState sampleState{};
    if (sampleTrace) {
        sampleState = inspectCalibrationSample(*sampleTrace, sampleSavedSource);
    } else if (calibrated) {
        sampleState.actualMl = calibration.actualMl;
    }

    Esp32BaseWeb::sendChunk("<table class='latest-record-table'><tr><th>时间</th><th>目标</th><th>估算出水</th><th>确认容量</th><th>脉冲</th><th>明细</th><th>样本状态</th><th>操作</th></tr><tr><td>");
    Esp32BaseWeb::sendChunk(startTime);
    Esp32BaseWeb::sendChunk("</td><td>");
    Esp32BaseWeb::sendChunk(targetText);
    Esp32BaseWeb::sendChunk("</td><td>");
    sendLiters(record.volumeMl);
    Esp32BaseWeb::sendChunk("</td><td>");
    if (calibrated) {
        sendLitersMl(calibration.actualMl);
    } else {
        Esp32BaseWeb::sendChunk("-");
    }
    sendFmt("</td><td>%luP (%luP/L)</td><td>",
            static_cast<unsigned long>(record.pulseCount),
            static_cast<unsigned long>(pulsePerLiter));
    if (sampleTrace) {
        sendTraceDetailLink(true,
                            sampleSavedSource,
                            sampleTrace->traceId,
                            1,
                            sampleSavedSource ? "已保存到设备" : "RAM 中",
                            sampleSavedSource ? "trace-badge trace-source-link status-ok" : "trace-badge trace-source-link status-muted");
    } else {
        Esp32BaseWeb::sendChunk("<span class='status-pill status-muted'>无明细</span>");
    }
    Esp32BaseWeb::sendChunk("</td><td>");
    if (sampleTrace) {
        sendCalibrationSampleStatusPills(sampleState, sampleSavedSource, "latest-status-pills");
    } else {
        Esp32BaseWeb::sendChunk("<span class='latest-status-pills'>");
        Esp32BaseWeb::sendChunk(calibrated ? "<span class='status-pill status-ok'>容量已确认</span>"
                                           : "<span class='status-pill status-muted'>待确认容量</span>");
        Esp32BaseWeb::sendChunk("<span class='status-pill status-muted'>不参与分段生成</span></span>");
    }
    Esp32BaseWeb::sendChunk("</td><td><div class='row-actions latest-actions'><a class='btn-link' href='#confirm-latest-volume'>确认/校准</a></div></td></tr>"
                            "<tr id='confirm-latest-volume' class='latest-calibration-edit-row'><td colspan='8'>"
                            "<form class='latest-calibration-form' method='post' action='/faucet/calibration' onsubmit='return once(this)'>"
                            "<input type='hidden' name='action' value='calibrate'>"
                            "<label class='field latest-volume-field'><span>确认后的实际出水量（ml）</span>");
    sendFmt("<input name='actualMl' type='number' min='%lu' max='%lu' step='1' value='%lu'></label>",
            static_cast<unsigned long>(kMinVolumePresetMl),
            static_cast<unsigned long>(kMaxVolumePresetMl),
            static_cast<unsigned long>(defaultActualMl));
    Esp32BaseWeb::sendChunk("<span class='hint'>如果估算准确，直接确认即可；如果不准确，请改为量杯读数。</span>"
                            "<div class='form-actions'><input type='submit' value='确认容量'><a class='btn-link' href='#latest-record'>取消</a></div>"
                            "</form></td></tr></table>");
    Esp32BaseWeb::sendChunk("<p class='hint'>确认/校准容量：如果估算准确，直接确认即可；如果不准确，请改为量杯读数。确认后该容量可作为样本真值。"
                            "保存后会同步匹配明细并自动入库；已截断或已淘汰的明细不会入库，不会修改原始脉冲或当前启用参数。</p>");

    if (calibrated) {
        char calibratedAt[40]{};
        formatWaterRecordTime(WaterRecord{calibration.calibratedAt,
                                          0,
                                          0,
                                          0,
                                          0,
                                          0,
                                          WaterMode::Volume,
                                          WaterResult::Completed,
                                          0,
                                          0,
                                          0.0f,
                                          {0, 0, 0, 0}},
                              calibratedAt,
                              sizeof(calibratedAt));
        const std::int32_t estimateDiff =
            static_cast<std::int32_t>(record.volumeMl) - static_cast<std::int32_t>(calibration.actualMl);
        Esp32BaseWeb::sendChunk("<p class='hint'>上次校准记录：第 ");
        sendFmt("%u 次 / %s / 实测脉冲/升 %luP/L / 估算差 ",
                static_cast<unsigned>(calibration.calibrationCount),
                calibratedAt[0] ? calibratedAt : "未知",
                static_cast<unsigned long>(measuredPulsePerLiter(record, calibration)));
        sendSignedLiters(estimateDiff);
        Esp32BaseWeb::sendChunk(" / 控制参数未修改。</p>");
    }
    Esp32BaseWeb::sendChunk("</section>");
}

void sendCalibrationSampleRow(const WaterPulseTrace& trace, bool savedSource, std::uint32_t samplePulseWindowSec) {
    char startTime[40]{};
    formatWaterRecordListTime(trace.record, startTime, sizeof(startTime));
    const CalibrationSampleState state = inspectCalibrationSample(trace, savedSource);
    std::uint32_t firstWindowPulses = 0;
    const bool firstWindowReady = firstSecondsPulseTotal(trace, savedSource, samplePulseWindowSec, firstWindowPulses);
    Esp32BaseWeb::sendChunk("<tr><td>");
    Esp32BaseWeb::sendChunk(startTime);
    Esp32BaseWeb::sendChunk("</td><td>");
    if (state.actualMl > 0) {
        sendLitersMl(state.actualMl);
    } else {
        Esp32BaseWeb::sendChunk("-");
    }
    sendFmt("</td><td>%luP / %lu点</td><td>",
            static_cast<unsigned long>(trace.totalPulses),
            static_cast<unsigned long>(trace.sampleCount));
    if (firstWindowReady) {
        sendFmt("%luP", static_cast<unsigned long>(firstWindowPulses));
    } else {
        Esp32BaseWeb::sendChunk("-");
    }
    Esp32BaseWeb::sendChunk("</td><td>");
    if (state.stable) {
        sendFmt("第 %lus", static_cast<unsigned long>(state.stableStartSec));
    } else {
        Esp32BaseWeb::sendChunk("-");
    }
    Esp32BaseWeb::sendChunk("</td><td>");
    sendTraceDetailLink(true,
                        savedSource,
                        trace.traceId,
                        1,
                        savedSource ? "已保存到设备" : "RAM 中",
                        savedSource ? "trace-badge trace-source-link status-ok" : "trace-badge trace-source-link status-muted");
    Esp32BaseWeb::sendChunk("</td><td>");
    sendCalibrationSampleStatusPills(state, savedSource, "sample-status-pills");
    Esp32BaseWeb::sendChunk("</td></tr>");
}

void sendCalibrationSamplesPanel(std::uint32_t samplePulseWindowSec) {
    Esp32BaseWeb::sendChunk("<section class='panel'><div class='panel-head'><h3>样本</h3></div>"
                            "<p class='hint'>这里展示有脉冲明细的数据。RAM 临时样本重启会丢失；只有已保存到设备、容量已确认且稳态识别成功的样本才参与候选参数生成。</p>");
    WaterPulseTrace* savedTraces = nullptr;
    std::size_t savedCount = 0;
    if (ensureSavedPulseTracesReady()) {
        savedTraces = new (std::nothrow) WaterPulseTrace[kSavedPulseTraceMaxCountLimit]{};
        if (savedTraces) {
            savedCount = g_context.savedPulseTraces->list(savedTraces, kSavedPulseTraceMaxCountLimit);
        }
    }
    const std::size_t ramCount = g_context.pulseTraces ? g_context.pulseTraces->count() : 0;
    Esp32BaseWeb::sendChunk("<form class='sample-window-form' method='get' action='/faucet/calibration'>"
                            "<label class='field sample-window-field'><span>前几秒脉冲总数</span>");
    sendFmt("<input name='sampleSeconds' type='number' min='1' max='60' step='1' value='%u'></label>"
            "<input type='submit' value='应用'></form>",
            static_cast<unsigned>(samplePulseWindowSec));
    Esp32BaseWeb::sendChunk("<p class='hint'>用于观察启动阶段脉冲分布；范围 1-60 秒，默认 10 秒。</p>");
    if (savedCount == 0 && ramCount == 0) {
        delete[] savedTraces;
        Esp32BaseWeb::sendChunk("<p class='hint'>还没有脉冲明细样本。</p></section>");
        return;
    }
    sendFmt("<table class='calibration-sample-table'><tr><th>时间</th><th>确认容量</th><th>脉冲</th><th>前 %u 秒脉冲</th><th>稳态</th><th>来源</th><th>状态</th></tr>",
            static_cast<unsigned>(samplePulseWindowSec));
    WaterRecord listed[kSavedPulseTraceMaxCountLimit]{};
    std::size_t listedCount = 0;
    for (std::size_t i = 0; i < savedCount; ++i) {
        sendCalibrationSampleRow(savedTraces[i], true, samplePulseWindowSec);
        if (listedCount < kSavedPulseTraceMaxCountLimit) {
            listed[listedCount++] = savedTraces[i].record;
        }
    }
    if (g_context.pulseTraces) {
        for (std::size_t offset = 0; offset < ramCount; ++offset) {
            const std::size_t index = ramCount - 1 - offset;
            const WaterPulseTrace* trace = g_context.pulseTraces->traceAt(index);
            if (!trace || !trace->finished || traceAlreadyListed(listed, listedCount, trace->record)) {
                continue;
            }
            sendCalibrationSampleRow(*trace, false, samplePulseWindowSec);
        }
    }
    Esp32BaseWeb::sendChunk("</table></section>");
    delete[] savedTraces;
}

void sendCalibrationGenerationPanel(bool canCalibrate, const WaterRecord& record) {
    Esp32BaseWeb::sendChunk("<section class='panel'><h3>参数生成</h3>"
                            "<p class='hint'>手动执行：只扫描已保存到设备、容量已确认且稳态识别成功的样本，生成候选参数；候选保存到参数槽前不会改变当前出水估算。</p>");
    (void)canCalibrate;
    (void)record;
    Esp32BaseWeb::sendChunk("<div class='form-actions'>"
                            "<form method='post' action='/faucet/calibration' onsubmit='return once(this)'>"
                            "<input type='hidden' name='action' value='generate_segmented'>");
    Esp32BaseWeb::sendChunk("<input type='submit' value='生成候选参数'></form>");
    Esp32BaseWeb::sendChunk("</div></section>");
}

std::uint32_t sumRealRecordVolumeSince(std::uint32_t startTime) {
    if (!g_context.records || !g_context.records->ready() || startTime < kMinRealDateSeconds) {
        return 0;
    }
    std::uint32_t total = 0;
    WaterRecord* records = new (std::nothrow) WaterRecord[kMaxRecordPageSize]{};
    if (!records) {
        return 0;
    }
    const std::size_t count = g_context.records->count();
    for (std::size_t offset = 0; offset < count; offset += kMaxRecordPageSize) {
        const std::size_t page = offset / kMaxRecordPageSize;
        const std::size_t read = g_context.records->readPage(page, kMaxRecordPageSize, records, kMaxRecordPageSize);
        if (read == 0) {
            break;
        }
        for (std::size_t i = 0; i < read; ++i) {
            if (waterRecordHasRealTime(records[i]) && records[i].startTime >= startTime && records[i].volumeMl > 0) {
                addSaturating(total, records[i].volumeMl);
            }
        }
    }
    delete[] records;
    return total;
}

void sendDailyChart(const WaterUsageSummary& summary) {
    std::uint32_t maxVolume = 0;
    std::uint32_t maxCount = 0;
    for (std::size_t i = 0; i < summary.dayCount; ++i) {
        if (summary.days[i].volumeMl > maxVolume) {
            maxVolume = summary.days[i].volumeMl;
        }
        if (summary.days[i].count > maxCount) {
            maxCount = summary.days[i].count;
        }
    }
    const std::uint32_t chartMax = maxVolume == 0 ? 1000UL : maxVolume;
    const std::uint32_t countMax = maxCount == 0 ? 1UL : maxCount;
    Esp32BaseWeb::sendChunk("<section class='daily-chart'><div class='chart-head'><h3>最近 30 天出水量</h3>"
                            "<span class='chart-unit'>每日出水量 (L) · 每日次数</span></div>"
                            "<svg viewBox='0 0 1080 292' role='img' aria-label='最近30天每日出水量和每日次数'>");
    constexpr std::uint32_t top = 56;
    constexpr std::uint32_t baseY = 222;
    constexpr std::uint32_t chartHeight = baseY - top;
    constexpr std::uint32_t left = 90;
    constexpr std::uint32_t step = 31;
    constexpr std::uint32_t barWidth = 16;
    Esp32BaseWeb::sendChunk("<line class='axis' x1='72' y1='222' x2='1030' y2='222'></line>"
                            "<line class='axis' x1='72' y1='48' x2='72' y2='222'></line>"
                            "<line class='count-axis' x1='1030' y1='48' x2='1030' y2='222'></line>");
    for (std::uint32_t tick = 0; tick < 5; ++tick) {
        const std::uint32_t tickValue = (chartMax * tick) / 4UL;
        const std::uint32_t y = baseY - (chartHeight * tick) / 4UL;
        char tickText[24]{};
        formatLiters(tickValue, tickText, sizeof(tickText));
        sendFmt("<line class='grid' x1='72' y1='%lu' x2='1030' y2='%lu'></line>"
                "<text class='chart-y-tick' x='62' y='%lu'>%s</text>",
                static_cast<unsigned long>(y),
                static_cast<unsigned long>(y),
                static_cast<unsigned long>(y + 4UL),
                tickText);
    }
    std::uint32_t previousCountTick = countMax + 1UL;
    for (std::uint32_t tick = 0; tick < 4; ++tick) {
        const std::uint32_t countValue = (countMax * tick + 1UL) / 3UL;
        if (tick > 0 && countValue == previousCountTick) {
            continue;
        }
        previousCountTick = countValue;
        const std::uint32_t y = baseY - (chartHeight * countValue) / countMax;
        sendFmt("<text class='count-y-tick' x='1040' y='%lu'>%lu 次</text>",
                static_cast<unsigned long>(y + 4UL),
                static_cast<unsigned long>(countValue));
    }
    for (std::size_t i = 0; i < summary.dayCount; ++i) {
        const std::uint32_t x = left + static_cast<std::uint32_t>(i) * step;
        const DailyUsageBucket& day = summary.days[i];
        char label[8]{};
        char volume[24]{};
        char barLabel[12]{};
        char duration[24]{};
        formatDayLabel(day.dayIndex, label, sizeof(label));
        formatLiters(day.volumeMl, volume, sizeof(volume));
        formatChartLiters(day.volumeMl, barLabel, sizeof(barLabel));
        formatDurationShort(day.durationSec, duration, sizeof(duration));
        const std::uint32_t avgMl = day.count == 0 ? 0 : day.volumeMl / day.count;
        const std::uint32_t barHeight = day.volumeMl == 0 ? 0 : (day.volumeMl * chartHeight) / chartMax;
        const std::uint32_t y = baseY - barHeight;
        const std::uint32_t center = x + barWidth / 2UL;
        sendFmt("<rect class='%s' x='%lu' y='%lu' width='%lu' height='%lu' rx='1'><title>"
                "%s：%s · %u 次 · %s · 平均 %lu ml/次</title></rect>"
                "<text class='bar-label' x='%lu' y='%lu'>%s</text>"
                "<text class='x-label' x='%lu' y='250' transform='rotate(-45 %lu 250)'>%s</text>",
                day.count == 0 ? "bar empty-bar" : "bar",
                static_cast<unsigned long>(x),
                static_cast<unsigned long>(barHeight == 0 ? baseY - 3UL : y),
                static_cast<unsigned long>(barWidth),
                static_cast<unsigned long>(barHeight == 0 ? 3UL : barHeight),
                label,
                volume,
                static_cast<unsigned>(day.count),
                duration,
                static_cast<unsigned long>(avgMl),
                static_cast<unsigned long>(center),
                static_cast<unsigned long>(barHeight == 0 ? baseY - 10UL : (y > 10UL ? y - 8UL : y)),
                barLabel,
                static_cast<unsigned long>(center),
                static_cast<unsigned long>(center),
                label);
    }
    if (summary.dayCount > 0) {
        Esp32BaseWeb::sendChunk("<polyline class='count-line-halo' points='");
        for (std::size_t i = 0; i < summary.dayCount; ++i) {
            const DailyUsageBucket& day = summary.days[i];
            const std::uint32_t x = left + static_cast<std::uint32_t>(i) * step + barWidth / 2UL;
            const std::uint32_t y = baseY - (static_cast<std::uint32_t>(day.count) * chartHeight) / countMax;
            sendFmt("%s%lu,%lu",
                    i == 0 ? "" : " ",
                    static_cast<unsigned long>(x),
                    static_cast<unsigned long>(y));
        }
        Esp32BaseWeb::sendChunk("'></polyline><polyline class='count-line' points='");
        for (std::size_t i = 0; i < summary.dayCount; ++i) {
            const DailyUsageBucket& day = summary.days[i];
            const std::uint32_t x = left + static_cast<std::uint32_t>(i) * step + barWidth / 2UL;
            const std::uint32_t y = baseY - (static_cast<std::uint32_t>(day.count) * chartHeight) / countMax;
            sendFmt("%s%lu,%lu",
                    i == 0 ? "" : " ",
                    static_cast<unsigned long>(x),
                    static_cast<unsigned long>(y));
        }
        Esp32BaseWeb::sendChunk("'></polyline>");
        for (std::size_t i = 0; i < summary.dayCount; ++i) {
            const DailyUsageBucket& day = summary.days[i];
            if (day.count == 0) {
                continue;
            }
            const std::uint32_t center = left + static_cast<std::uint32_t>(i) * step + barWidth / 2UL;
            const std::uint32_t y = baseY - (static_cast<std::uint32_t>(day.count) * chartHeight) / countMax;
            const std::uint32_t barHeight = day.volumeMl == 0 ? 0 : (day.volumeMl * chartHeight) / chartMax;
            const std::uint32_t barTop = baseY - barHeight;
            const std::uint32_t barLabelY = barHeight == 0 ? baseY - 10UL : (barTop > 10UL ? barTop - 8UL : barTop);
            const std::uint32_t countLabelY = chooseCountLabelY(y, barLabelY);
            char countText[12]{};
            std::snprintf(countText, sizeof(countText), "%u次", static_cast<unsigned>(day.count));
            sendFmt("<circle class='count-dot' cx='%lu' cy='%lu' r='1.7'><title>%u 次</title></circle>"
                    "<text class='count-label' x='%lu' y='%lu'>%s</text>",
                    static_cast<unsigned long>(center),
                    static_cast<unsigned long>(y),
                    static_cast<unsigned>(day.count),
                    static_cast<unsigned long>(center),
                    static_cast<unsigned long>(countLabelY),
                    countText);
        }
    }
    Esp32BaseWeb::sendChunk("</svg></section>");
}

