tangyangguang/Esp32_Faucet/src/web/FaucetWeb.cpp
    sendLatestCalibrationRecordPanel(canCalibrate, record);
    sendCalibrationGenerationPanel(canCalibrate, record);

    Esp32BaseWeb::sendChunk("<div class='metric-grid calibration-param-grid'>");
    sendCalibrationParameterPanels();
    Esp32BaseWeb::sendChunk("</div>");
    sendCalibrationFormulaPanel();
    sendCalibrationSamplesPanel(samplePulseWindowSec);
    sendPageEnd();
}

void handleRecordDetailPage() {
    if (!Esp32BaseWeb::checkAuth()) {
        return;
    }
    char text[24]{};
    const bool fromCalibration = calibrationContextRequested();
    const char* backHref = fromCalibration ? "/faucet/calibration" : "/faucet/records";
    const char* backLabel = fromCalibration ? "返回校准" : "返回记录";
    const char* detailPath = fromCalibration ? "/faucet/calibration/detail" : "/faucet/records/detail";
    const char* contextParam = fromCalibration ? "from=calibration&" : "";
    bool rawRequest = false;
    if (getParam("raw", text, sizeof(text))) {
        std::uint32_t rawValue = 0;
        rawRequest = parseU32(text, rawValue) && rawValue != 0;
    }
    bool rawTraceShowAll = false;
    if (getParam("all", text, sizeof(text))) {
        std::uint32_t allValue = 0;
        rawTraceShowAll = parseU32(text, allValue) && allValue != 0;
    }
    if (!contextReady()) {
        if (rawRequest) {
            sendPlainTextResponse(503, "上下文未就绪。\n");
        } else {
            Esp32BaseWeb::sendHeader("脉冲明细");
            Esp32BaseWeb::sendChunk("<h2>脉冲明细</h2><p class='err'>上下文未就绪。</p>");
            sendPageEnd();
        }
        return;
    }
    if (!g_context.pulseTraces && !g_context.savedPulseTraces) {
        if (rawRequest) {
            sendPlainTextResponse(503, "脉冲明细缓存不可用。\n");
            return;
        }
        Esp32BaseWeb::sendHeader("脉冲明细");
        sendFmt("<h2>脉冲明细</h2><p class='err'>脉冲明细缓存不可用。</p><p><a class='btn-link' href='%s'>%s</a></p>",
                backHref,
                backLabel);
        sendPageEnd();
        return;
    }
    std::uint32_t traceId = 0;
    if (!getParam("trace", text, sizeof(text)) || !parseU32(text, traceId)) {
        if (rawRequest) {
            sendPlainTextResponse(400, "明细编号无效。\n");
            return;
        }
        Esp32BaseWeb::sendHeader("脉冲明细");
        sendFmt("<h2>脉冲明细</h2><p class='err'>明细编号无效。</p><p><a class='btn-link' href='%s'>%s</a></p>",
                backHref,
                backLabel);
        sendPageEnd();
        return;
    }
    std::uint32_t bucketSeconds = 1;
    if (getParam("bucket", text, sizeof(text))) {
        parseU32(text, bucketSeconds);
    }
    if (bucketSeconds != 2 && bucketSeconds != 3 && bucketSeconds != 4 && bucketSeconds != 5) {
        bucketSeconds = 1;
    }
    bool savedSource = false;
    if (getParam("saved", text, sizeof(text))) {
        std::uint32_t savedValue = 0;
        savedSource = parseU32(text, savedValue) && savedValue != 0;
    }
    WaterPulseTrace savedTrace{};
    const WaterPulseTrace* trace = nullptr;
    if (savedSource) {
        if (ensureSavedPulseTracesReady() && g_context.savedPulseTraces->findById(traceId, savedTrace)) {
            trace = &savedTrace;
        }
    } else if (g_context.pulseTraces) {
        trace = g_context.pulseTraces->findById(traceId);
    }
    if (!trace) {
        if (rawRequest) {
            sendPlainTextResponse(404, "该脉冲明细不存在或已被 RAM 缓存淘汰。\n");
            return;
        }
        Esp32BaseWeb::sendHeader("脉冲明细");
        sendFmt("<h2>脉冲明细</h2><p class='err'>该脉冲明细不存在或已被 RAM 缓存淘汰。</p><p><a class='btn-link' href='%s'>%s</a></p>",
                backHref,
                backLabel);
        sendPageEnd();
        return;
    }

    WaterPulseTraceSample* samples = new (std::nothrow) WaterPulseTraceSample[trace->sampleCount]{};
    if (!samples) {
        delete[] samples;
        if (rawRequest) {
            sendPlainTextResponse(500, "内存不足，无法生成脉冲明细。\n");
            return;
        }
        Esp32BaseWeb::sendHeader("脉冲明细");
        Esp32BaseWeb::sendChunk("<p class='err'>内存不足，无法生成脉冲明细。</p>");
        sendPageEnd();
        return;
    }
    if (savedSource) {
        if (!g_context.savedPulseTraces ||
            g_context.savedPulseTraces->readSamples(trace->traceId, samples, trace->sampleCount) != trace->sampleCount) {
            delete[] samples;
            if (rawRequest) {
                sendPlainTextResponse(500, "已保存明细读取失败。\n");
                return;
            }
            Esp32BaseWeb::sendHeader("脉冲明细");
            Esp32BaseWeb::sendChunk("<p class='err'>已保存明细读取失败。</p>");
            sendPageEnd();
            return;
        }
    } else {
        for (std::size_t i = 0; i < trace->sampleCount; ++i) {
            const WaterPulseTraceSample* sample = g_context.pulseTraces ? g_context.pulseTraces->sampleAt(*trace, i) : nullptr;
            samples[i] = sample ? *sample : WaterPulseTraceSample{};
        }
    }
    if (rawRequest) {
        sendPulseTraceRawText(*trace, samples, rawTraceShowAll);
        delete[] samples;
        return;
    }
    WaterPulseTraceBucket* buckets = new (std::nothrow) WaterPulseTraceBucket[trace->sampleCount]{};
    if (!buckets) {
        delete[] samples;
        Esp32BaseWeb::sendHeader("脉冲明细");
        Esp32BaseWeb::sendChunk("<p class='err'>内存不足，无法生成脉冲明细。</p>");
        sendPageEnd();
        return;
    }
    const std::size_t bucketCount =
        aggregateWaterPulseTrace(*trace, samples, trace->sampleCount, bucketSeconds, buckets, trace->sampleCount);
    const WaterPulseTraceAnalysis analysis = analyzeWaterPulseTrace(*trace, samples, trace->sampleCount);

    char startTime[40]{};
    formatWaterRecordTime(trace->record, startTime, sizeof(startTime));
    const std::size_t traceBytes = sizeof(WaterPulseTrace) + trace->sampleCount * sizeof(WaterPulseTraceSample);
    char traceKb[24]{};
    formatKb(traceBytes, traceKb, sizeof(traceKb));
    const bool savedStoreReady = ensureSavedPulseTracesReady();
    const bool alreadySaved = savedStoreReady && g_context.savedPulseTraces->containsRecord(trace->record);
    const std::uint32_t traceActualMl = actualMlForSegmentedSample(*trace);
    const bool traceActualSynced = trace->actualMl > 0;
    const bool traceActualFromRecord = !traceActualSynced && traceActualMl > 0;
    Esp32BaseWeb::sendHeader("脉冲明细");
    sendFmt("<h2>脉冲明细</h2><div class='form-actions'><a class='btn-link' href='%s'>%s</a>",
            backHref,
            backLabel);
    if (savedSource) {
        Esp32BaseWeb::sendChunk("<form method='post' action='/api/faucet/records' onsubmit=\"return confirm('确认删除这条已保存的脉冲明细？')&&once(this)\">"
                                "<input type='hidden' name='action' value='delete'>");
        if (fromCalibration) {
            Esp32BaseWeb::sendChunk("<input type='hidden' name='returnTo' value='calibration'>");
        }
        sendFmt("<input type='hidden' name='trace' value='%lu'><input class='secondary' type='submit' value='删除已保存明细'></form>",
                static_cast<unsigned long>(trace->traceId));
    } else if (savedStoreReady) {
        if (alreadySaved) {
            Esp32BaseWeb::sendChunk("<span class='status-pill status-ok'>已保存到设备</span>");
        } else {
            Esp32BaseWeb::sendChunk("<span class='status-pill status-muted'>确认容量后自动入库</span>");
        }
    } else {
        Esp32BaseWeb::sendChunk("<span class='status-pill status-muted'>样本库不可用</span>");
    }
    Esp32BaseWeb::sendChunk("</div>");

